-- SEED: 마이프로틴 임팩트 아이솔레이트
INSERT INTO proteins (
  title,
  weight,
  avatar_file,
  topic,
  taste,
  description,
  scoop,
  protein_per_scoop,
  base_pack_count,
  base_date
)
VALUES (
  '마이프로틴 임팩트 아이솔레이트',
  5000,
  'https://<your-project-ref>.supabase.co/storage/v1/object/public/protein/myprotein_impact_isolate.png',
  'wpi',
  '무맛',
  '해당 영양정보는 무맛 기준으로 작성\n선택하시는 맛에 따라 영양정보가 다름\n성분 업그레이드 혹은 재배합 과정에서 간혹 성분표의 변경 가능',
  30,
  25.8,
  1,
  '2024-01-21'
);

-- 마이프로틴 임팩트 아이솔레이트 가격 히스토리
INSERT INTO protein_prices_daily (protein_id, observed_date, price)
VALUES
(27, '2024-01-21', 136092),
(27, '2024-02-02', 125294),
(27, '2024-02-20', 136688),
(27, '2024-03-03', 125294),
(27, '2024-03-20', 126890),
(27, '2024-04-04', 106094),
(27, '2024-04-17', 116890),
(27, '2024-05-05', 104696),
(27, '2024-06-06', 129084),
(27, '2024-07-07', 121686),
(27, '2024-07-17', 124084),
(27, '2024-08-15', 102795),
(27, '2024-09-09', 141184),
(27, '2024-09-20', 146762),
(27, '2024-10-10', 149762),
(27, '2024-11-11', 140595),
(27, '2024-11-29', 140950),
(27, '2024-12-12', 155562),
(27, '2025-01-01', 156911),
(27, '2025-01-10', 149784),
(27, '2025-02-02', 149784),
(27, '2025-02-14', 157562),
(27, '2025-03-03', 148784),
(27, '2025-03-20', 150116),
(27, '2025-05-05', 148895),
(27, '2025-06-06', 150116),
(27, '2025-06-19', 187163),
(27, '2025-07-07', 204062),
(27, '2025-08-08', 205962),
(27, '2025-09-09', 197000);
